Revit 2027 API
PanelScheduleView.GetTableData Method
 Gets table data that can be written to
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PanelScheduleData GetTableData()
Public Function GetTableData As PanelScheduleData
public:
PanelScheduleData^ GetTableData()
member GetTableData : unit -> PanelScheduleData
Return Value
PanelScheduleData
 The PanelScheduleData
See Also
Reference
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace